In [2]:
import pandas as pd

In [19]:
df = pd.read_csv('data/seg.csv',header=None)

In [20]:
country={
      "36" : "Australia",
      "784" : "UAE",
      "682" : "Saudi Arabia",
      "414" : "Kuwait",
      "512" : "Oman",
      "48" : "Bahrain",
      "400" : "Jordan",
      "364" : "Iran",
      "504" : "Morocco",
      "12" : "Algeria",
      "788" : "Tunisia",
      "760" : "Syria",
      "586" : "Pakistan",
      "887" : "Yemen",
      "634" : "Qatar",
      "56" : "Belgium",
      "250" : "France",
      "724" : "Spain",
      "528" : "Netherlands",
      "203" : "Czech",
      "792" : "Turkey",
      "642" : "Romania",
      "458" : "Malaysia",
      "702" : "Singapore",
      "356" : "India",
      "764" : "Thailand",
      "704" : "Vietnam",
      "608" : "Philippines",
      "710" : "South Africa",
      "422" : "Lebanon",
      "368" : "Iraq",
      "376" : "Israel",
      "116" : "Cambodia",
      "818" : "Egypt",
      "434" : "Libya",
      "478" : "Mauritania",
      "4" : "Afghanistan",
      "344" : "Hong Kong",
      "804" : "Ukraine",
      "360" : "Indonesia",
      "156" : "China",
      "410" : "South Korea",
      "408" : "North Korea",
      "392" : "Japan",
      "496" : "Mongolia",
      "124" : "Canada",
      "840" : "USA",
      "826" : "UK",
      "144" : "Sri Lanka",
      "566" : "Nigeria",
      "404" : "Kenya",
      "554" : "New Zealand",
      "275" : "Palestine",
      "484" : "Mexico",
      "76" : "Brazil",
      "170" : "Colombia",
      "32" : "Argentina",
      "152" : "Chile",
      "604" : "Peru",
      "862" : "Venezuela",
      "218" : "Ecuador",
      "68" : "Bolivia",
      "600" : "Paraguay",
      "858" : "Uruguay",
      "158" : "Taiwan",
      "729" : "Sudan",
      "276" : "Germany",
      "300" : "Greece",
      "380" : "Italy",
      "288" : "Ghana",
      "834" : "Tanzania",
      "231" : "Ethiopia",
      "716" : "Zimbabwe",
      "894" : "Zambia",
      "270" : "Gambia",
      "454" : "Malawi",
      "208" : "Denmark",
      "578" : "Norway",
      "246" : "Finland",
      "50" : "Bangladesh",
      "372" : "Ireland",
      "756" : "Switzerland",
      "752" : "Sweden",
      "192" : "Cuba",
      "388" : "Jamaica",
      "643" : "Russia",
      "70" : "Bosnia-Herzegovina",
      "40" : "Austria",
      "620" : "Portugal",
      "516" : "Namibia",
      "72" : "Botswana",
      "800" : "Uganda",
      "728" : "South Sudan",
      "703" : "Slovakia",
      "348" : "Hungary",
      "266" : "Gabon",
      "508" : "Mozambique",
      "24" : "Angola",
      "120" : "Cameroon",
      "384" : "CoteDIvore",
      "96" : "Brunei",
      "426" : "Lesotho",
      "430" : "Liberia",
      "450" : "Madagascar",
      "466" : "Mali",
      "480" : "Mauritius",
      "562" : "Niger",
      "646" : "Rwanda",
      "686" : "Senegal",
      "706" : "Somalia",
      "748" : "Swaziland",
      "180" : "Congo Dem Rep",
      "178" : "Congo",
      "148" : "Chad",
      "690" : "Seychelles",
      "232" : "Eritrea",
      "694" : "Sierra Leone",
      "768" : "Togo"
      }

In [37]:
new_country={int(k):v for k,v in country.items()}
new_country

{36: 'Australia',
 784: 'UAE',
 682: 'Saudi Arabia',
 414: 'Kuwait',
 512: 'Oman',
 48: 'Bahrain',
 400: 'Jordan',
 364: 'Iran',
 504: 'Morocco',
 12: 'Algeria',
 788: 'Tunisia',
 760: 'Syria',
 586: 'Pakistan',
 887: 'Yemen',
 634: 'Qatar',
 56: 'Belgium',
 250: 'France',
 724: 'Spain',
 528: 'Netherlands',
 203: 'Czech',
 792: 'Turkey',
 642: 'Romania',
 458: 'Malaysia',
 702: 'Singapore',
 356: 'India',
 764: 'Thailand',
 704: 'Vietnam',
 608: 'Philippines',
 710: 'South Africa',
 422: 'Lebanon',
 368: 'Iraq',
 376: 'Israel',
 116: 'Cambodia',
 818: 'Egypt',
 434: 'Libya',
 478: 'Mauritania',
 4: 'Afghanistan',
 344: 'Hong Kong',
 804: 'Ukraine',
 360: 'Indonesia',
 156: 'China',
 410: 'South Korea',
 408: 'North Korea',
 392: 'Japan',
 496: 'Mongolia',
 124: 'Canada',
 840: 'USA',
 826: 'UK',
 144: 'Sri Lanka',
 566: 'Nigeria',
 404: 'Kenya',
 554: 'New Zealand',
 275: 'Palestine',
 484: 'Mexico',
 76: 'Brazil',
 170: 'Colombia',
 32: 'Argentina',
 152: 'Chile',
 604: 'Peru',
 862: 'Venezuela',
 218: 'Ecuador',
 68: 'Bolivia',
 600: 'Paraguay',
 858: 'Uruguay',
 158: 'Taiwan',
 729: 'Sudan',
 276: 'Germany',
 300: 'Greece',
 380: 'Italy',
 288: 'Ghana',
 834: 'Tanzania',
 231: 'Ethiopia',
 716: 'Zimbabwe',
 894: 'Zambia',
 270: 'Gambia',
 454: 'Malawi',
 208: 'Denmark',
 578: 'Norway',
 246: 'Finland',
 50: 'Bangladesh',
 372: 'Ireland',
 756: 'Switzerland',
 752: 'Sweden',
 192: 'Cuba',
 388: 'Jamaica',
 643: 'Russia',
 70: 'Bosnia-Herzegovina',
 40: 'Austria',
 620: 'Portugal',
 516: 'Namibia',
 72: 'Botswana',
 800: 'Uganda',
 728: 'South Sudan',
 703: 'Slovakia',
 348: 'Hungary',
 266: 'Gabon',
 508: 'Mozambique',
 24: 'Angola',
 120: 'Cameroon',
 384: 'CoteDIvore',
 96: 'Brunei',
 426: 'Lesotho',
 430: 'Liberia',
 450: 'Madagascar',
 466: 'Mali',
 480: 'Mauritius',
 562: 'Niger',
 646: 'Rwanda',
 686: 'Senegal',
 706: 'Somalia',
 748: 'Swaziland',
 180: 'Congo Dem Rep',
 178: 'Congo',
 148: 'Chad',
 690: 'Seychelles',
 232: 'Eritrea',
 694: 'Sierra Leone',
 768: 'Togo'}

In [38]:
df.columns=['country','interest','count']

In [39]:
df['country']=df['country'].map(new_country)
df.head(5)

        country  interest    count
0  South Africa      1038  1415095
1  South Africa      1244  1796275
2      Zimbabwe      1329    59528
3      Malaysia       826   152979
4           NaN      1225   337281

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165531 entries, 0 to 165530
Data columns (total 3 columns):
country     82089 non-null object
interest    165531 non-null int64
count       165531 non-null int64
dtypes: int64(2), object(1)
memory usage: 3.8+ MB

In [8]:
import json

In [9]:
with open('data/interest_attr_groups.json','r') as input:
    interests = json.load(input)

In [10]:
interests_dict={}
for i in interests:
    interests_dict[i['id']]=i['name']
    if 'attributes' in i:
        for j in i['attributes']:
            interests_dict[j['id']]=j['name']

In [41]:
index_df = pd.read_json('data/core_segments_external_ids.json',lines=True)
index_df.head()

,dmp_names,exclude,external_id,id,include,name
0,[ddp],[],742407270,949,[[1927]],"Interest > Diseases and Conditions > Ear, Nose..."
1,[ddp],[],742407957,1215,[[2193]],"Interest > Music and Audio > Soundtracks, TV a..."
2,[ddp],[],738308195,1332,[[2310]],Interest > Science
3,[ddp],[],738307994,796,[[1774]],Interest > Adult Contemporary Music
4,[ddp],[],742406850,795,[[1773]],Interest > Adult Contemporary Music > Soft AC ...

In [42]:
ndf=pd.merge(df,index_df,left_on=['interest'],right_on=['id']).loc[:,['country','name','count']]

In [43]:
ndf.sort_values('count',ascending=False,inplace=True)

In [33]:
ndf.to_csv('data/result.csv')

In [34]:
res=ndf.pivot_table(values='count',index='name',columns='country')

In [35]:
res.to_csv('data/pivot_result.csv')

In [36]:
df = pd.read_csv('data/raw-seg.csv',header=None)

In [44]:
ndf.to_csv('data/raw-result.csv')
res=ndf.pivot_table(values='count',index='name',columns='country')
res.to_csv('data/raw-pivot_result.csv')

In [46]:
df_sync = pd.read_csv('data/seg.csv',header=None)

In [47]:
df_sync.columns=['country','interest','count']
df_sync['country']=df_sync['country'].map(new_country)
df_sync.head(5)

        country  interest   count
0  South Africa      1244  632940
1  South Africa      1465   45982
2       Bahrain      1459    3639
3  South Africa      1038  601222
4           UAE       930    7487

In [49]:
mdf = pd.merge(df,index_df,left_on=['interest'],right_on=['id'])

In [50]:
total_df=pd.merge(left=mdf,right=df_sync,left_on=['country','id'],right_on=['country','interest'])
total_df.head(5)

,country,interest_x,count_x,dmp_names,exclude,external_id,id,include,name,interest_y,count_y
0,South Africa,1038,1415095,[ddp],[],738308084,1038,[[2016]],Interest > Financial Assistance,1038,601222
1,Niger,1038,214,[ddp],[],738308084,1038,[[2016]],Interest > Financial Assistance,1038,9
2,Cambodia,1038,5161,[ddp],[],738308084,1038,[[2016]],Interest > Financial Assistance,1038,26
3,NaN,1038,1464,[ddp],[],738308084,1038,[[2016]],Interest > Financial Assistance,1038,23
4,NaN,1038,1464,[ddp],[],738308084,1038,[[2016]],Interest > Financial Assistance,1038,8

In [55]:
compact_df = total_df[['country','name','count_x','count_y']]
compact_df.columns=['country','name','count_before_sync','count_after_sync']
compact_df.head()

,country,name,count_before_sync,count_after_sync
0,South Africa,Interest > Financial Assistance,1415095,601222
1,Niger,Interest > Financial Assistance,214,9
2,Cambodia,Interest > Financial Assistance,5161,26
3,NaN,Interest > Financial Assistance,1464,23
4,NaN,Interest > Financial Assistance,1464,8

In [56]:
compact_df.sort_values('count_before_sync',ascending=False,inplace=True)
compact_df.to_csv('data/raw-result.csv')
# res=compact_df.pivot_table(values='count',index='interest',columns='country')
# res.to_csv('data/raw-pivot_result.csv')

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.